""" Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
толщиной в 1 см * чи сло см толщины полотна. Проверить работу метода.
Например: 20м * 5000м * 25кг * 5см = 12500 т
"""


class Road:

    def __init__(self, __length, __width):
        self.__length = __length
        self.__width = __width

    def calculate_mass(self, thickness_sm, density):
        return (self.__length * self.__width * thickness_sm * density) / 1000


road1 = Road(20, 5000)
print(road1.calculate_mass(25, 5))
